In [1]:
import pandas as pd

In [2]:
names = pd.read_csv('yob1880.txt', names=['name', 'sex', 'births'])

In [3]:
names

           name sex  births
0          Mary   F    7065
1          Anna   F    2604
2          Emma   F    2003
3     Elizabeth   F    1939
4        Minnie   F    1746
...         ...  ..     ...
1995     Woodie   M       5
1996     Worthy   M       5
1997     Wright   M       5
1998       York   M       5
1999  Zachariah   M       5

[2000 rows x 3 columns]

In [5]:
names.groupby('sex')['births'].sum()

sex
F     90993
M    110493
Name: births, dtype: int64

In [6]:
names.head()

        name sex  births
0       Mary   F    7065
1       Anna   F    2604
2       Emma   F    2003
3  Elizabeth   F    1939
4     Minnie   F    1746

In [7]:
names.tail()

           name sex  births
1995     Woodie   M       5
1996     Worthy   M       5
1997     Wright   M       5
1998       York   M       5
1999  Zachariah   M       5

In [8]:
names['births'].sum()

201486

In [11]:
total_births = names.pivot_table('births', columns='sex', aggfunc=sum)

In [12]:
total_births

sex         F       M
births  90993  110493